Autodesk.Revit.DB.ComponentRepeater.RemoveRepeaters(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Removes component repeaters from the document,
but leaves the individual repeated components in their respective locations and
hosted on their original hosts.
Remarks:
In addition to the component repeaters the component repeater slots
are also removed from the document.
document:
The document that contains the component repeaters to remove.
elementIds:
The set of component repeaters that should be removed.
Returns:
A collection of components that were previously repeated by the component repeater.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in elementIds do not exist in the document.
-or-
Not all given elements are component repeaters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015 Subscription Update

Autodesk.Revit.DB.ComponentRepeater.RepeatElements(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Repeats a set of adaptive component hosted on one or more repeating references.
Remarks:
All elements must be adaptive family instances and have no shape handles.
At least one placement point must be hosted on a 1D or 2D repeating reference.
All other placement points can be hosted on a 0D, 1D or 2D repeating reference,
or must be unhosted.
Use Autodesk.Revit.DB.ComponentRepeater.CanElementBeRepeated(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId) to test whether an element meets these conditions.
document:
The document that contains the elements.
elementIds:
The set of adaptive components used as an input pattern for the repeating operation.
Returns:
One or more component repeater objects representing the result pattern of the repeating operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not allow creation of a component repeater.
-or-
The given element id set is empty.
-or-
One or more elements in elementIds do not exist in the document.
-or-
Not all given elements can be repeated. All elements must be adaptive family instances, have no shape handles, and have at least one placement
point hosted on a 1D or 2D repeating reference. The remaining placement points must be either unhosted or hosted on another repeating reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.ComponentRepeater.CanElementBeRepeated(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Determines whether an element can be repeated using the RepeatElements method.
Remarks:
The element must be an adaptive family instance and have no shape handles.
At least one placement point must be hosted on a 1D or 2D repeating reference.
All other placement points can be hosted on a 0D, 1D or 2D repeating reference,
or must be unhosted.
ADoc:
The document containing the element.
elementId:
The element to be tested.
Returns:
True if the element can be repeated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015 Subscription Update

Autodesk.Revit.DB.ComponentRepeater.IsTypeValidForRepeater(Autodesk.Revit.DB.ElementId)
Determines whether given family type can be used as the default type for the repeater.
typeId:
The element id of the type.
Returns:
True if the family type can be used as the default type for the repeater.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ComponentRepeater.DefaultFamilyType
The default family type for the component repeater.
Remarks:
The default family type is the type of the instances in default slots. This includes slots that are added when the repeater grows.
When setting this property, all slots with instances of the default type will change their components to an instance of the new default type.
Empty slots will remain unchanged.
Slots with non-default family instances will remain unchanged.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Invalid type for the repeater. The type must be an adaptive family with no shape handles.
In addition, it must have same category and same number of placement points as the current type of the repeater.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014